; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob7615) (:domain Depot)
(:objects
	depot0 depot1 depot2 depot3 - Depot
	distributor0 distributor1 distributor2 distributor3 - Distributor
	truck0 truck1 truck2 truck3 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate13)
	(at pallet1 depot1)
	(clear crate14)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear crate5)
	(at pallet4 distributor0)
	(clear pallet4)
	(at pallet5 distributor1)
	(clear crate9)
	(at pallet6 distributor2)
	(clear crate8)
	(at pallet7 distributor3)
	(clear crate10)
	(at pallet8 depot1)
	(clear crate11)
	(at pallet9 depot2)
	(clear pallet9)
	(at truck0 distributor2)
	(at truck1 depot0)
	(at truck2 depot1)
	(at truck3 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 distributor0)
	(available hoist4)
	(at hoist5 distributor1)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 distributor3)
	(available hoist7)
	(at crate0 distributor3)
	(on crate0 pallet7)
	(at crate1 distributor1)
	(on crate1 pallet5)
	(at crate2 depot3)
	(on crate2 pallet3)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 depot0)
	(on crate4 crate3)
	(at crate5 depot3)
	(on crate5 crate2)
	(at crate6 depot1)
	(on crate6 pallet1)
	(at crate7 distributor2)
	(on crate7 pallet6)
	(at crate8 distributor2)
	(on crate8 crate7)
	(at crate9 distributor1)
	(on crate9 crate1)
	(at crate10 distributor3)
	(on crate10 crate0)
	(at crate11 depot1)
	(on crate11 pallet8)
	(at crate12 depot1)
	(on crate12 crate6)
	(at crate13 depot0)
	(on crate13 crate4)
	(at crate14 depot1)
	(on crate14 crate12)
)

(:goal (and
		(on crate0 pallet3)
		(on crate1 crate11)
		(on crate2 pallet6)
		(on crate3 crate0)
		(on crate4 crate5)
		(on crate5 crate14)
		(on crate6 pallet4)
		(on crate7 pallet2)
		(on crate8 pallet7)
		(on crate9 crate8)
		(on crate11 pallet5)
		(on crate12 crate6)
		(on crate13 crate2)
		(on crate14 pallet1)
	)
)(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate14 crate12 depot1)
   deleted: (at crate14 depot1) (clear crate14) (available hoist1) (on crate14 crate12)
   added: (lifting hoist1 crate14) (clear crate12)
   goals met: 1 of 14
2. (load hoist1 crate14 truck2 depot1)
   deleted: (lifting hoist1 crate14)
   added: (in crate14 truck2) (available hoist1)
   goals met: 1 of 14
3. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 1 of 14
4. (lift hoist1 crate12 crate6 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist1) (on crate12 crate6)
   added: (lifting hoist1 crate12) (clear crate6)
   goals met: 0 of 14
5. (load hoist1 crate12 truck2 depot1)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck2) (available hoist1)
   goals met: 0 of 14
6. (lift hoist1 crate6 pallet1 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 pallet1)
   added: (lifting hoist1 crate6) (clear pallet1)
   goals met: 0 of 14
7. (load hoist1 crate6 truck2 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck2) (available hoist1)
   goals met: 0 of 14
8. (drive truck3 distributor1 depot3)
   deleted: (at truck3 distributor1)
   added: (at truck3 depot3)
   goals met: 0 of 14
9. (lift hoist3 crate5 crate2 depot3)
   deleted: (at crate5 depot3) (clear crate5) (available hoist3) (on crate5 crate2)
   added: (lifting hoist3 crate5) (clear crate2)
   goals met: 0 of 14
10. (load hoist3 crate5 truck3 depot3)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck3) (available hoist3)
   goals met: 0 of 14
11. (lift hoist3 crate2 pallet3 depot3)
   deleted: (at crate2 depot3) (clear crate2) (available hoist3) (on crate2 pallet3)
   added: (lifting hoist3 crate2) (clear pallet3)
   goals met: 0 of 14
12. (load hoist3 crate2 truck3 depot3)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck3) (available hoist3)
   goals met: 0 of 14
13. (drive truck3 depot3 distributor2)
   deleted: (at truck3 depot3)
   added: (at truck3 distributor2)
   goals met: 0 of 14
14. (lift hoist6 crate8 crate7 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist6) (on crate8 crate7)
   added: (lifting hoist6 crate8) (clear crate7)
   goals met: 0 of 14
15. (load hoist6 crate8 truck0 distributor2)
   deleted: (lifting hoist6 crate8)
   added: (in crate8 truck0) (available hoist6)
   goals met: 0 of 14
16. (lift hoist6 crate7 pallet6 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist6) (on crate7 pallet6)
   added: (lifting hoist6 crate7) (clear pallet6)
   goals met: 0 of 14
17. (load hoist6 crate7 truck0 distributor2)
   deleted: (lifting hoist6 crate7)
   added: (in crate7 truck0) (available hoist6)
   goals met: 0 of 14
18. (unload hoist6 crate2 truck3 distributor2)
   deleted: (in crate2 truck3) (available hoist6)
   added: (lifting hoist6 crate2)
   goals met: 0 of 14
19. (drive truck2 depot1 distributor0)
   deleted: (at truck2 depot1)
   added: (at truck2 distributor0)
   goals met: 0 of 14
20. (lift hoist5 crate9 crate1 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist5) (on crate9 crate1)
   added: (lifting hoist5 crate9) (clear crate1)
   goals met: 0 of 14
21. (load hoist5 crate9 truck1 distributor1)
   deleted: (lifting hoist5 crate9)
   added: (in crate9 truck1) (available hoist5)
   goals met: 0 of 14
22. (drive truck1 distributor1 distributor3)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor3)
   goals met: 0 of 14
23. (unload hoist4 crate6 truck2 distributor0)
   deleted: (in crate6 truck2) (available hoist4)
   added: (lifting hoist4 crate6)
   goals met: 0 of 14
24. (drop hoist4 crate6 pallet4 distributor0)
   deleted: (lifting hoist4 crate6) (clear pallet4)
   added: (available hoist4) (at crate6 distributor0) (clear crate6) (on crate6 pallet4)
   goals met: 1 of 14
25. (unload hoist4 crate12 truck2 distributor0)
   deleted: (in crate12 truck2) (available hoist4)
   added: (lifting hoist4 crate12)
   goals met: 1 of 14
26. (drop hoist4 crate12 crate6 distributor0)
   deleted: (lifting hoist4 crate12) (clear crate6)
   added: (available hoist4) (at crate12 distributor0) (clear crate12) (on crate12 crate6)
   goals met: 2 of 14
27. (drive truck2 distributor0 depot1)
   deleted: (at truck2 distributor0)
   added: (at truck2 depot1)
   goals met: 2 of 14
28. (drop hoist6 crate2 pallet6 distributor2)
   deleted: (lifting hoist6 crate2) (clear pallet6)
   added: (available hoist6) (at crate2 distributor2) (clear crate2) (on crate2 pallet6)
   goals met: 3 of 14
29. (unload hoist1 crate14 truck2 depot1)
   deleted: (in crate14 truck2) (available hoist1)
   added: (lifting hoist1 crate14)
   goals met: 3 of 14
30. (drop hoist1 crate14 pallet1 depot1)
   deleted: (lifting hoist1 crate14) (clear pallet1)
   added: (available hoist1) (at crate14 depot1) (clear crate14) (on crate14 pallet1)
   goals met: 4 of 14
31. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 4 of 14
32. (unload hoist2 crate7 truck0 depot2)
   deleted: (in crate7 truck0) (available hoist2)
   added: (lifting hoist2 crate7)
   goals met: 4 of 14
33. (drop hoist2 crate7 pallet2 depot2)
   deleted: (lifting hoist2 crate7) (clear pallet2)
   added: (available hoist2) (at crate7 depot2) (clear crate7) (on crate7 pallet2)
   goals met: 5 of 14
34. (drive truck3 distributor2 depot0)
   deleted: (at truck3 distributor2)
   added: (at truck3 depot0)
   goals met: 5 of 14
35. (lift hoist0 crate13 crate4 depot0)
   deleted: (at crate13 depot0) (clear crate13) (available hoist0) (on crate13 crate4)
   added: (lifting hoist0 crate13) (clear crate4)
   goals met: 5 of 14
36. (load hoist0 crate13 truck3 depot0)
   deleted: (lifting hoist0 crate13)
   added: (in crate13 truck3) (available hoist0)
   goals met: 5 of 14
37. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   goals met: 5 of 14
38. (load hoist0 crate4 truck3 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck3) (available hoist0)
   goals met: 5 of 14
39. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet0)
   added: (lifting hoist0 crate3) (clear pallet0)
   goals met: 5 of 14
40. (load hoist0 crate3 truck3 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck3) (available hoist0)
   goals met: 5 of 14
41. (drive truck3 depot0 distributor3)
   deleted: (at truck3 depot0)
   added: (at truck3 distributor3)
   goals met: 5 of 14
42. (unload hoist7 crate3 truck3 distributor3)
   deleted: (in crate3 truck3) (available hoist7)
   added: (lifting hoist7 crate3)
   goals met: 5 of 14
43. (drive truck0 depot2 distributor3)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor3)
   goals met: 5 of 14
44. (load hoist7 crate3 truck0 distributor3)
   deleted: (lifting hoist7 crate3)
   added: (in crate3 truck0) (available hoist7)
   goals met: 5 of 14
45. (lift hoist7 crate10 crate0 distributor3)
   deleted: (at crate10 distributor3) (clear crate10) (available hoist7) (on crate10 crate0)
   added: (lifting hoist7 crate10) (clear crate0)
   goals met: 5 of 14
46. (load hoist7 crate10 truck3 distributor3)
   deleted: (lifting hoist7 crate10)
   added: (in crate10 truck3) (available hoist7)
   goals met: 5 of 14
47. (lift hoist7 crate0 pallet7 distributor3)
   deleted: (at crate0 distributor3) (clear crate0) (available hoist7) (on crate0 pallet7)
   added: (lifting hoist7 crate0) (clear pallet7)
   goals met: 5 of 14
48. (load hoist7 crate0 truck0 distributor3)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck0) (available hoist7)
   goals met: 5 of 14
49. (unload hoist7 crate8 truck0 distributor3)
   deleted: (in crate8 truck0) (available hoist7)
   added: (lifting hoist7 crate8)
   goals met: 5 of 14
50. (drive truck0 distributor3 depot3)
   deleted: (at truck0 distributor3)
   added: (at truck0 depot3)
   goals met: 5 of 14
51. (drive truck3 distributor3 depot1)
   deleted: (at truck3 distributor3)
   added: (at truck3 depot1)
   goals met: 5 of 14
52. (unload hoist3 crate0 truck0 depot3)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   goals met: 5 of 14
53. (drop hoist3 crate0 pallet3 depot3)
   deleted: (lifting hoist3 crate0) (clear pallet3)
   added: (available hoist3) (at crate0 depot3) (clear crate0) (on crate0 pallet3)
   goals met: 6 of 14
54. (unload hoist3 crate3 truck0 depot3)
   deleted: (in crate3 truck0) (available hoist3)
   added: (lifting hoist3 crate3)
   goals met: 6 of 14
55. (drop hoist3 crate3 crate0 depot3)
   deleted: (lifting hoist3 crate3) (clear crate0)
   added: (available hoist3) (at crate3 depot3) (clear crate3) (on crate3 crate0)
   goals met: 7 of 14
56. (unload hoist1 crate5 truck3 depot1)
   deleted: (in crate5 truck3) (available hoist1)
   added: (lifting hoist1 crate5)
   goals met: 7 of 14
57. (drop hoist1 crate5 crate14 depot1)
   deleted: (lifting hoist1 crate5) (clear crate14)
   added: (available hoist1) (at crate5 depot1) (clear crate5) (on crate5 crate14)
   goals met: 8 of 14
58. (unload hoist1 crate4 truck3 depot1)
   deleted: (in crate4 truck3) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 8 of 14
59. (drop hoist1 crate4 crate5 depot1)
   deleted: (lifting hoist1 crate4) (clear crate5)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 crate5)
   goals met: 9 of 14
60. (lift hoist1 crate11 pallet8 depot1)
   deleted: (at crate11 depot1) (clear crate11) (available hoist1) (on crate11 pallet8)
   added: (lifting hoist1 crate11) (clear pallet8)
   goals met: 9 of 14
61. (load hoist1 crate11 truck2 depot1)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck2) (available hoist1)
   goals met: 9 of 14
62. (drive truck2 depot1 distributor1)
   deleted: (at truck2 depot1)
   added: (at truck2 distributor1)
   goals met: 9 of 14
63. (lift hoist5 crate1 pallet5 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist5) (on crate1 pallet5)
   added: (lifting hoist5 crate1) (clear pallet5)
   goals met: 9 of 14
64. (drive truck1 distributor3 distributor1)
   deleted: (at truck1 distributor3)
   added: (at truck1 distributor1)
   goals met: 9 of 14
65. (load hoist5 crate1 truck1 distributor1)
   deleted: (lifting hoist5 crate1)
   added: (in crate1 truck1) (available hoist5)
   goals met: 9 of 14
66. (unload hoist5 crate11 truck2 distributor1)
   deleted: (in crate11 truck2) (available hoist5)
   added: (lifting hoist5 crate11)
   goals met: 9 of 14
67. (drop hoist5 crate11 pallet5 distributor1)
   deleted: (lifting hoist5 crate11) (clear pallet5)
   added: (available hoist5) (at crate11 distributor1) (clear crate11) (on crate11 pallet5)
   goals met: 10 of 14
68. (drive truck3 depot1 distributor2)
   deleted: (at truck3 depot1)
   added: (at truck3 distributor2)
   goals met: 10 of 14
69. (unload hoist6 crate13 truck3 distributor2)
   deleted: (in crate13 truck3) (available hoist6)
   added: (lifting hoist6 crate13)
   goals met: 10 of 14
70. (drop hoist6 crate13 crate2 distributor2)
   deleted: (lifting hoist6 crate13) (clear crate2)
   added: (available hoist6) (at crate13 distributor2) (clear crate13) (on crate13 crate2)
   goals met: 11 of 14
71. (unload hoist5 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist5)
   added: (lifting hoist5 crate1)
   goals met: 11 of 14
72. (drop hoist5 crate1 crate11 distributor1)
   deleted: (lifting hoist5 crate1) (clear crate11)
   added: (available hoist5) (at crate1 distributor1) (clear crate1) (on crate1 crate11)
   goals met: 12 of 14
73. (drop hoist7 crate8 pallet7 distributor3)
   deleted: (lifting hoist7 crate8) (clear pallet7)
   added: (available hoist7) (at crate8 distributor3) (clear crate8) (on crate8 pallet7)
   goals met: 13 of 14
74. (drive truck1 distributor1 distributor3)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor3)
   goals met: 13 of 14
75. (unload hoist7 crate9 truck1 distributor3)
   deleted: (in crate9 truck1) (available hoist7)
   added: (lifting hoist7 crate9)
   goals met: 13 of 14
76. (drop hoist7 crate9 crate8 distributor3)
   deleted: (lifting hoist7 crate9) (clear crate8)
   added: (available hoist7) (at crate9 distributor3) (clear crate9) (on crate9 crate8)
   goals met: 14 of 14
